In [2]:
import pandas as pd

In [1]:
data={

      'ID': [1,2,3,4,5,6],
      'Name': ['Tanishq','Sarvesh','Avantika','Ruthvek','Pradnya','Aditi'],
      'Age' : [25,30,35,40,45,21],
      'Country' : ['Maharashtra','Tamil Nadu','Kerala','Goa','Uttar Pradesh','Madhya Pradesh'],
      'Sales': [200,450,300,800,150,400]

}

In [3]:
df=pd.DataFrame(data)

print("Orginal Dataset")
print(df)

Orginal Dataset
   ID      Name  Age         Country  Sales
0   1   Tanishq   25     Maharashtra    200
1   2   Sarvesh   30      Tamil Nadu    450
2   3  Avantika   35          Kerala    300
3   4   Ruthvek   40             Goa    800
4   5   Pradnya   45   Uttar Pradesh    150
5   6     Aditi   21  Madhya Pradesh    400

In [4]:
df['Name_Upper']=df['Name'].str.upper()

print("Dataset after adding new column")
print(df[['ID','Name','Name_Upper']])

Dataset after adding new column
   ID      Name Name_Upper
0   1   Tanishq    TANISHQ
1   2   Sarvesh    SARVESH
2   3  Avantika   AVANTIKA
3   4   Ruthvek    RUTHVEK
4   5   Pradnya    PRADNYA
5   6     Aditi      ADITI

In [5]:
df_copy1=df.copy()
df_copy2=df.copy()

df_copy1['Sales'] *= 1.1
df_copy2['Age'] += 5

print("\nMulticast (Modified Copies):")
print("Copy 1 (Sales Increased):")
print(df_copy1)
print("\nCopy 2 (Age Increased):")
print(df_copy2)

Multicast (Modified Copies):
Copy 1 (Sales Increased):
   ID      Name  Age         Country  Sales Name_Upper
0   1   Tanishq   25     Maharashtra  220.0    TANISHQ
1   2   Sarvesh   30      Tamil Nadu  495.0    SARVESH
2   3  Avantika   35          Kerala  330.0   AVANTIKA
3   4   Ruthvek   40             Goa  880.0    RUTHVEK
4   5   Pradnya   45   Uttar Pradesh  165.0    PRADNYA
5   6     Aditi   21  Madhya Pradesh  440.0      ADITI

Copy 2 (Age Increased):
   ID      Name  Age         Country  Sales Name_Upper
0   1   Tanishq   30     Maharashtra    200    TANISHQ
1   2   Sarvesh   35      Tamil Nadu    450    SARVESH
2   3  Avantika   40          Kerala    300   AVANTIKA
3   4   Ruthvek   45             Goa    800    RUTHVEK
4   5   Pradnya   50   Uttar Pradesh    150    PRADNYA
5   6     Aditi   26  Madhya Pradesh    400      ADITI

In [6]:
high_sales=df[df['Sales']>300]
low_sales=df[df['Sales']<=300]
print("\nConditional Split:")
print("High Sales:")
print(high_sales)
print("\nLow Sales:")
print(low_sales)

Conditional Split:
High Sales:
   ID     Name  Age         Country  Sales Name_Upper
1   2  Sarvesh   30      Tamil Nadu    450    SARVESH
3   4  Ruthvek   40             Goa    800    RUTHVEK
5   6    Aditi   21  Madhya Pradesh    400      ADITI

Low Sales:
   ID      Name  Age        Country  Sales Name_Upper
0   1   Tanishq   25    Maharashtra    200    TANISHQ
2   3  Avantika   35         Kerala    300   AVANTIKA
4   5   Pradnya   45  Uttar Pradesh    150    PRADNYA

In [7]:
agg_df=df.groupby('Country')['Sales'].sum().reset_index()
print("\nAggregation:")
print(agg_df)

Aggregation:
          Country  Sales
0             Goa    800
1          Kerala    300
2  Madhya Pradesh    400
3     Maharashtra    200
4      Tamil Nadu    450
5   Uttar Pradesh    150

In [8]:
sorted_df=df.sort_values(by='Sales',ascending=False)
print("\nSorted Data:")
print(sorted_df)

Sorted Data:
   ID      Name  Age         Country  Sales Name_Upper
3   4   Ruthvek   40             Goa    800    RUTHVEK
1   2   Sarvesh   30      Tamil Nadu    450    SARVESH
5   6     Aditi   21  Madhya Pradesh    400      ADITI
2   3  Avantika   35          Kerala    300   AVANTIKA
0   1   Tanishq   25     Maharashtra    200    TANISHQ
4   5   Pradnya   45   Uttar Pradesh    150    PRADNYA

In [9]:
df['Sales_Category']=df['Sales'].apply(lambda x: 'High' if x>300 else 'Low')
print("\nDerived Column (Sales Category):")
print(df[['ID','Name','Sales','Sales_Category']])

Derived Column (Sales Category):
   ID      Name  Sales Sales_Category
0   1   Tanishq    200            Low
1   2   Sarvesh    450           High
2   3  Avantika    300            Low
3   4   Ruthvek    800           High
4   5   Pradnya    150            Low
5   6     Aditi    400           High